# Data Integration

## Concatenation

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame(
    {"A":[1,2,3], "name":[0,9,8], "age":[2,4,6]}
)
df2 = pd.DataFrame(
    {"acc":[5,6,10], "loan":[44,55,3]}
)

In [3]:
df1

   A  name  age
0  1     0    2
1  2     9    4
2  3     8    6

In [4]:
df2

   acc  loan
0    5    44
1    6    55
2   10     3

In [5]:
row_concat = pd.concat([df1, df2], axis=0)

In [6]:
row_concat

     A  name  age   acc  loan
0  1.0   0.0  2.0   NaN   NaN
1  2.0   9.0  4.0   NaN   NaN
2  3.0   8.0  6.0   NaN   NaN
0  NaN   NaN  NaN   5.0  44.0
1  NaN   NaN  NaN   6.0  55.0
2  NaN   NaN  NaN  10.0   3.0

In [7]:
column_concat = pd.concat([df1, df2], axis=1)

In [8]:
column_concat

   A  name  age  acc  loan
0  1     0    2    5    44
1  2     9    4    6    55
2  3     8    6   10     3

## Merging

In [9]:
df1 =  pd.DataFrame(
    {"key":["A","B","C","D"], "inv_val":[22,34,55,66], "acc":[4,7,8,9]}
)

In [10]:
df2 =  pd.DataFrame(
    {"key":["E","F","G","H"], "hel_ration":[25,34,95,16], "acc":[4,7,88,12]}
)

In [11]:
df1

  key  inv_val  acc
0   A       22    4
1   B       34    7
2   C       55    8
3   D       66    9

In [12]:
df2

  key  hel_ration  acc
0   E          25    4
1   F          34    7
2   G          95   88
3   H          16   12

In [13]:
pd.merge(df1, df2, how = "inner", on = "acc", suffixes=("_df1","_df2"))

  key_df1  inv_val  acc key_df2  hel_ration
0       A       22    4       E          25
1       B       34    7       F          34

In [14]:
pd.merge(df1, df2, how = "outer", on = "acc", suffixes=("_df1","_df2"))

  key_df1  inv_val  acc key_df2  hel_ration
0       A     22.0    4       E        25.0
1       B     34.0    7       F        34.0
2       C     55.0    8     NaN         NaN
3       D     66.0    9     NaN         NaN
4     NaN      NaN   12       H        16.0
5     NaN      NaN   88       G        95.0

In [15]:
pd.merge(df1, df2, how = "left", on = "acc", suffixes=("_df1","_df2"))

  key_df1  inv_val  acc key_df2  hel_ration
0       A       22    4       E        25.0
1       B       34    7       F        34.0
2       C       55    8     NaN         NaN
3       D       66    9     NaN         NaN

In [16]:
pd.merge(df1, df2, how = "right", on = "acc", suffixes=("_df1","_df2"))

  key_df1  inv_val  acc key_df2  hel_ration
0       A     22.0    4       E          25
1       B     34.0    7       F          34
2     NaN      NaN   88       G          95
3     NaN      NaN   12       H          16

In [17]:
# merge with df 
df1.merge(df2, how = "inner", on = "acc")

  key_x  inv_val  acc key_y  hel_ration
0     A       22    4     E          25
1     B       34    7     F          34

## Joining

Joining is similar to merging, but is specifically used to combine dataframes based on their indexes. You can use the `pd.DataFrame.join()` method to join dataframes.

In [18]:
df1 = pd.DataFrame(
    {"key":["A","B","C","D"], "inv_val":[99,55,33,22],"acc":[1,3,5,7]}
)

df2 = pd.DataFrame(
    {"key":["E","B","C","Z"], "hel_ration":[66,0.88,63,29],"acc":[11,32,53,74]}
)

In [19]:
df1 = df1.set_index("key")
df1

     inv_val  acc
key
A         99    1
B         55    3
C         33    5
D         22    7

In [20]:
df2 = df2.set_index("key")
df2

     hel_ration  acc
key
E         66.00   11
B          0.88   32
C         63.00   53
Z         29.00   74

In [21]:
# pd.join()

df1.join(df2,how = "inner", lsuffix="_x")

     inv_val  acc_x  hel_ration  acc
key
B         55      3        0.88   32
C         33      5       63.00   53

In [22]:
df2.join(df1, how = "right", rsuffix = "_2")

     hel_ration   acc  inv_val  acc_2
key
A           NaN   NaN       99      1
B          0.88  32.0       55      3
C         63.00  53.0       33      5
D           NaN   NaN       22      7

## Stacking

Stacking is the process of vertically combining datasets with the same columns. The datasets are aligned by their column names and then stacked on top of each other. You can use the `dataframe.stack()` function to stack a dataframe.

In [24]:
df1 = pd.DataFrame(
    {"key":["A","B","C","D"], "inv_val":[99,55,33,22],"acc":[1,3,5,7]}, index = ["w","X","Y","Z"]
)

In [25]:
df1

  key  inv_val  acc
w   A       99    1
X   B       55    3
Y   C       33    5
Z   D       22    7

In [26]:
stacked = df1.stack()
stacked

w  key         A
   inv_val    99
   acc         1
X  key         B
   inv_val    55
   acc         3
Y  key         C
   inv_val    33
   acc         5
Z  key         D
   inv_val    22
   acc         7
dtype: object

In [27]:
stacked.unstack()

  key inv_val acc
w   A      99   1
X   B      55   3
Y   C      33   5
Z   D      22   7